-- MySQL dump 10.13  Distrib 8.0.38, for Win64 (x86_64)
--
-- Host: localhost    Database: surgerywaitinglist
-- ------------------------------------------------------
-- Server version	8.0.39

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `patients`
--

DROP TABLE IF EXISTS `patients`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `patients` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `name` varchar(45) DEFAULT NULL,
  `surname` varchar(45) DEFAULT NULL,
  `fatherName` varchar(45) DEFAULT NULL,
  `birthDate` varchar(45) DEFAULT NULL,
  `property` enum('Μόνιμος Στρατιωτικός','Έφεδρος Στρατιωτικός','Αστυνομικός','Απόστρατος','Μέλος','Ιδιώτης') DEFAULT NULL,
  PRIMARY KEY (`ID`),
  UNIQUE KEY `PATIENTDATA` (`name`,`surname`,`fatherName`,`birthDate`)
) ENGINE=InnoDB AUTO_INCREMENT=596 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `patients`
--

LOCK TABLES `patients` WRITE;
/*!40000 ALTER TABLE `patients` DISABLE KEYS */;
INSERT INTO `patients` VALUES (483,'Αλεξανδρος','Ζάππας','Δεσποινα','2024-01-19','Έφεδρος Στρατιωτικός'),(484,'Παναγιώτης','Μπότσαρης','Μιχαήλ','2023-10-07','Μέλος'),(485,'Αθανάσιος','Αυγερινός','Φώτιος','2024-04-19','Ιδιώτης'),(486,'Παρασκευη','Κακριδής','Ιωάννης','2024-09-26','Ιδιώτης'),(487,'Παρασκευάς','Καζαντζής','Σωτήριος','2024-06-30','Έφεδρος Στρατιωτικός'),(488,'Στυλιανός','Ζάρκος','Κωνσταντινα','2024-06-05','Ιδιώτης'),(489,'Αριστείδης','Μαγγίνας','Γεώργιος','2023-11-13','Αστυνομικός'),(490,'Χρυσουλα','Ζαχαρίου','Σταύρος','2024-04-07','Απόστρατος'),(491,'Μαρια','Ζαφειρόπουλος','Σταυρουλα','2023-11-17','Αστυνομικός'),(492,'Ιωαννα','Παπανικολάου','Ιωάννης','2024-06-13','Απόστρατος'),(493,'Γεωργια','Παπάγος','Άγγελος','2024-06-03','Αστυνομικός'),(494,'Γεώργιος','Δελής','Παναγιώτης','2024-06-20','Έφεδρος Στρατιωτικός'),(495,'Διονύσιος','Αναγνώστου','Σταύρος','2023-12-17','Έφεδρος Στρατιωτικός'),(496,'Ιωάννης','Λαμπρόπουλος','Αντώνης','2024-03-19','Αστυνομικός'),(497,'Λεωνίδας','Γιαννόπουλος','Φώτιος','2024-09-02','Αστυνομικός'),(498,'Λεωνίδας','Διαμαντόπουλος','Θεόδωρος','2024-06-03','Ιδιώτης'),(499,'Απόστολος','Αγγελόπουλος','Στέφανος','2023-10-14','Αστυνομικός'),(500,'Πέτρος','Αλεξιάδης','Σταύρος','2023-11-08','Μέλος'),(501,'Δεσποινα','Αναγνωστάκης','Δημήτρης','2023-12-02','Ιδιώτης'),(502,'Διονύσιος','Βλαστός','Γρηγόριος','2024-03-31','Μέλος'),(503,'Δημήτρης','Δεσποτόπουλος','Αντώνης','2024-07-16','Μέλος'),(504,'Δεσποινα','Μπουκουβαλαίοι','Χαράλαμπος','2024-07-29','Μόνιμος Στρατιωτικός'),(505,'Παρασκευη','Γιαννόπουλος','Εμμανουήλ','2024-01-02','Απόστρατος'),(506,'Μιχαήλ','Κανακάρης-Ρούφος','Απόστολος','2024-06-30','Απόστρατος'),(507,'Ιωαννα','Πανταζής','Στέφανος','2024-05-13','Αστυνομικός'),(508,'Αθανασια','Ζέρβας','Αθανασια','2024-04-16','Μέλος'),(509,'Σωτήριος','Νικολάκος','Παρασκευάς','2023-10-13','Αστυνομικός'),(510,'Παύλος','Κομνηνός','Φώτιος','2024-02-28','Απόστρατος'),(511,'Διονύσιος','Βασιλείου','Αναστασια','2023-11-09','Μόνιμος Στρατιωτικός'),(512,'Αικατερινη','Κωνσταντίνου','Αριστείδης','2024-05-07','Ιδιώτης'),(513,'Αθανασια','Αλιβιζάτος','Απόστολος','2023-12-27','Ιδιώτης'),(514,'Αριστείδης','Γκόφας','Θεόδωρος','2023-12-12','Ιδιώτης'),(515,'Χαράλαμπος','Κοσμόπουλος','Σταυρουλα','2024-03-02','Αστυνομικός'),(516,'Σωτήριος','Βλαστός','Φώτιος','2024-06-29','Μέλος'),(517,'Μιχαήλ','Αλεξόπουλος','Δημητρα','2023-10-11','Ιδιώτης'),(518,'Δεσποινα','Ηλιόπουλος','Γρηγόριος','2024-01-03','Ιδιώτης'),(519,'Παναγιωτα','Παπαδάκης','Πέτρος','2024-07-09','Μέλος'),(520,'Αθανάσιος','Βλαστός','Ανδρέας','2024-07-29','Αστυνομικός'),(521,'Πέτρος','Ζέρβας','Γρηγόριος','2024-03-06','Μέλος'),(522,'Παναγιώτης','Αργυριάδης','Αθανασια','2024-04-27','Αστυνομικός'),(523,'Μιχαήλ','Αποστόλου','Αναστάσιος','2024-06-27','Απόστρατος'),(524,'Απόστολος','Λόντος','Στέφανος','2023-12-04','Μέλος'),(525,'Παναγιωτα','Βιλαέτης','Ευάγγελος','2023-12-21','Μόνιμος Στρατιωτικός'),(526,'Στέφανος','Δαμασκηνός','Θεόδωρος','2023-12-08','Μέλος'),(527,'Παρασκευάς','Παπανδρέου','Σταυρουλα','2024-01-21','Μέλος'),(528,'Δημητρα','Μελετόπουλος','Δημήτρης','2024-09-11','Ιδιώτης'),(529,'Σταύρος','Αλαφούζος','Σταυρουλα','2024-08-17','Μέλος'),(530,'Χρυσουλα','Μήτζου','Ευαγγελια','2023-10-09','Μόνιμος Στρατιωτικός'),(531,'Απόστολος','Αντωνόπουλος','Δεσποινα','2024-08-02','Ιδιώτης'),(532,'Αννα','Παπακωνσταντίνου','Αλεξανδρα','2023-11-18','Μόνιμος Στρατιωτικός'),(533,'Σωτήριος','Βαρουξής','Αικατερινη','2024-01-29','Μέλος'),(534,'Παρασκευη','Βασιλειάδης','Αννα','2023-10-27','Μέλος'),(535,'Σωτήριος','Μπότσαρης','Παύλος','2024-05-03','Απόστρατος'),(536,'Ευστάθιος','Καλύβας','Σοφια','2024-05-28','Αστυνομικός'),(537,'Χρήστος','Αλεξάνδρου','Χριστινα','2024-04-09','Ιδιώτης'),(538,'Δεσποινα','Κομνηνός','Ιωάννης','2023-11-10','Αστυνομικός'),(539,'Ευάγγελος','Παπαντωνίου','Χρήστος','2023-10-11','Αστυνομικός'),(540,'Αννα','Παπαστεφάνου','Αθανάσιος','2024-05-16','Αστυνομικός'),(541,'Αθανασια','Αλεβιζόπουλος','Νικόλαος','2024-03-23','Μόνιμος Στρατιωτικός'),(542,'Απόστολος','Ζαφειρόπουλος','Νικόλαος','2024-06-25','Ιδιώτης'),(543,'Ηλίας','Βασιλειάδης','Φώτιος','2024-03-30','Ιδιώτης'),(544,'Στέφανος','Αγγελίδου','Φώτιος','2023-11-12','Μόνιμος Στρατιωτικός'),(545,'Ελευθέριος','Παπαϊωάννου','Αριστείδης','2024-03-16','Μέλος'),(546,'Ευαγγελια','Μεσσηνέζης','Απόστολος','2023-10-13','Μόνιμος Στρατιωτικός'),(547,'Διονύσιος','Παπαστεφάνου','Παρασκευάς','2024-08-13','Μόνιμος Στρατιωτικός'),(548,'Αριστείδης','Δραγούμης','Δημήτρης','2024-05-29','Απόστρατος'),(549,'Νικόλαος','Δελή','Άγγελος','2024-06-05','Μέλος'),(550,'Ιωαννα','Ζαχαρίου','Νικόλαος','2023-11-12','Απόστρατος'),(551,'Στυλιανός','Καλάρης','Γεώργιος','2024-02-11','Απόστρατος'),(552,'Αθανάσιος','Μαυρίδης','Αντώνης','2024-09-27','Αστυνομικός'),(553,'Ιάσων','Πολίτης','Νίκολαος','1999-05-05','Έφεδρος Στρατιωτικός'),(554,'Κωστής','Χρήστου','Σταμάτιος','2024-09-13','Έφεδρος Στρατιωτικός'),(562,'we','rr','ww','1940-06-15','Απόστρατος'),(563,'dff','wdwd','ss','2000-05-25','Μέλος'),(564,'Αλέξης','Ζορμπάς','Νικόλαος','1970-12-26','Μόνιμος Στρατιωτικός'),(565,'Μπάμπης','Αντωνίου','Νίκος','1991-06-07','Μέλος'),(566,'Αναστασία','Πάνου','Χριστόφορος','2006-05-11','Μέλος'),(567,'Πηνελόπη','Ιακώβιδου','Νεκτάριος','1989-08-12','Μόνιμος Στρατιωτικός'),(568,'Νίκος','Πέτρου','Στέφανος','1960-04-13','Απόστρατος'),(569,'γηγξξ','γθηη','μμο','2010-08-11','Αστυνομικός'),(570,'mmkk','ctcyy','uuoo','1983-09-14','Μέλος'),(571,'ρρφ','ςφφς','5υηεςφςφ','1986-11-20','Αστυνομικός'),(572,'ff','vdd','svsvsv','1999-02-04','Αστυνομικός'),(573,'Αθηνά','Οικονόμου','Ευάγγελος','2003-06-13','Απόστρατος'),(574,'Κώστας','Χρήστου','Λύσανδρος','1979-06-01','Έφεδρος Στρατιωτικός'),(575,'Πέτρος','Κωνσταντίνου','Κυριάκος','2014-06-03','Μέλος'),(576,'Νίκος ','Αλετρός','Βαγγέλης','2007-01-03','Ιδιώτης'),(582,'e','r','a','1981-06-12','Μέλος'),(583,'σ','δ','ε','1999-11-01','Μέλος'),(584,'ο','η','ξ','1997-06-07','Απόστρατος'),(585,'πκ','πλ','πμ','1999-05-06','Έφεδρος Στρατιωτικός'),(586,'υιπ','υικλ','θοοο','2000-05-18','Μέλος'),(587,'κκ','τξ','ασ','2001-09-16','Μέλος'),(588,'λσλσ','σασασα','σασα','1993-06-18','Απόστρατος'),(589,'νγωβψβψ','νψ','νψνψνν','2000-05-18','Μέλος'),(590,'gfjffj','fjfjfj','fjfj','1999-05-13','Ιδιώτης'),(591,'sjshs','sdbdkd','rrkepe','2024-01-11','Αστυνομικός'),(592,'σδξσδξιιδσδο','δξκδσξδσξ','ρτερερερε','2024-10-31','Μέλος'),(593,'υτητβγτ','υυερυ','υυυ','2024-11-05','Ιδιώτης'),(594,'ρδφφωφ','φδσρδρ','ρφρρφδ','2015-04-14','Έφεδρος Στρατιωτικός'),(595,'δδββ','δδφσσσφσφφσφ','δδωβδδ','1995-02-16','Αστυνομικός');
/*!40000 ALTER TABLE `patients` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-11-14  7:32:07
