import { createSlice } from '@reduxjs/toolkit';
import dayjs from 'dayjs';
const initialState = {
  dateFormat :'YYYY-MM-DD',
  today:dayjs(dayjs().format('YYYY-MM-DD'),'YYYY-MM-DD'),
  
  properties: ["Στρατιωτικός", "Αστυνομικός", "Απόστρατος", "Μέλος", "Ιδιώτης"],
  fullProperties:["Μόνιμοι Στρατιωτικοί", "Έφεδροι Στρατιωτικοί", "Αστυνομικοί", "Απόστρατοι", "Μέλη", "Ιδιώτες"],
  NORMAL_COLOR: "#1677ff",
  WARNING_COLOR: "#faad14",
  DANGER_COLOR: "#ff4d4f",




  surgeries: {
    "Μύτη":["Βιοψία βλάβης-όγκου υπό διερεύνηση","Χρόνια ρινίτιδα","Μέση ρινοαντροστομίας άμφω",
      "Σκολίωση ρινικού διαφράγματος",
    "Σκολίωση ρινικού διαφράγματος+λειτουργική ρινοπλαστική", "Αποφρακτική υπνική άπνοια","Όγκοι καλοήθεις","Όγκοι κακοήθεις","Άλλου είδους επέμβαση"],
    "Παραρρίνιοι κόλποι":["Βιοψία βλάβης-όγκου υπό διερεύνηση","Χρόνια παραρρινοκολπίτιδα","Όγκοι καλοήθεις","Όγκοι κακοήθεις","Άλλου είδους επέμβαση"],
    "Τράχηλος":["Βιοψία βλάβης-όγκου υπό διερεύνηση", "Σιελαδενίτιδα","Όγκος παρωτίδας (παρωτιδεκτομή)","Όγκος υπογνάθιου αδένα (Αφαίρεση υπογνάθιου αδένα)",
    "Όγκος θυρεοειδή (θυρεοειδεκτομή)","Λεμφαδενικός καθαρισμός τραχήλου",
    "Συγγενείς διαμαρτίες (βρογχιακή κύστη, κύστη θυρεογλωσσικού πόρου)","Όγκοι καλοήθεις","Όγκοι κακοήθεις","Άλλου είδους επέμβαση"],
    "Αυτί":["Βιοψία βλάβης-όγκου υπό διερεύνηση","Όγκοι καλοήθεις","Όγκοι κακοήθεις","Άλλου είδους επέμβαση"],
    "Ρινοφάρυγγας":["Βιοψία βλάβης-όγκου υπό διερεύνηση","Υπερτροφία αδενοειδών εκβλαστήσεων","Όγκοι καλοήθεις","Όγκοι κακοήθεις","Άλλου είδους επέμβαση"],
    "Στοματοφάρυγγας":["Βιοψία βλάβης-όγκου υπό διερεύνηση","Χρόνια αμυγδαλίτιδα", "Αποφρακτική υπνική άπνοια","Όγκοι καλοήθεις","Όγκοι κακοήθεις","Άλλου είδους επέμβαση"],
    "Υποφάρυγγας":["Βιοψία βλάβης-όγκου υπό διερεύνηση","Όγκοι καλοήθεις","Όγκοι κακοήθεις","Άλλου είδους επέμβαση"],
    "Λάρυγγας":["Βιοψία βλάβης-όγκου υπό διερεύνηση","Όγκοι καλοήθεις","Όγκοι κακοήθεις","Άλλου είδους επέμβαση"],
    "Άλλη περιοχή":["Βιοψία βλάβης-όγκου υπό διερεύνηση","Όγκοι καλοήθεις","Όγκοι κακοήθεις","Άλλου είδους επέμβαση"]
  },
  ranks: {
    "Στρατιωτικός": ["Στρατιώτης (Στρ)", "Δεκανέας (Δνεας)", "Λοχίας (Λχίας)", "Επιλοχίας (Επχίας)", "Αρχιλοχίας (Αλχιας)", 
      "Δόκιμος Έφεδρος Αξιωματικός (ΔΕΑ)", "Ανθυπασπιστής (Ανθστής)", "Ανθυπολοχαγός (Ανθλγός)",
      "Υπολοχαγός (Υπλγός)", "Λοχαγός (Λγός)", "Ταγματάρχης (Τχης)", "Αντισυνταγματάρχης (Ανχης)",
      "Συνταγματάρχης (Σχης)", "Ταξίαρχος (Ταξχος)", "Υπόστράτηγος (Υπγος)", "Αντιτράτηγος (Αντγος)", "Στρατηγός (Στγος)"],
    "Αστυνομικός": ["Κατώτερος", "Ανώτερος", "Ανώτατος"]
  }
};

const constantsSlice = createSlice({
  name: 'constants',
  initialState,
  reducers: {
    getColorByStatus: (state, action) => {
      const status = action.payload;
      if (status<=3){
        return state.NORMAL_COLOR
      }
      else if (status<=5){
        return state.WARNING_COLOR
      }
      else{
        return state.DANGER_COLOR
      }


    // You can add actions here if you want to modify the data in future
  }
}
});

export default constantsSlice.reducer;